#Область СлужебныеПроцедурыИФункции

Функция ТелеграмБотСообщение(ТекстСообщения) Экспорт
	
  Соединение = Новый HTTPСоединение("api.telegram.org",443,,,,, Новый ЗащищенноеСоединениеOpenSSL);
  
  СтрокаЗапроса = СтрШаблон("/bot%1/sendMessage", Константы.ВКМ_ТокенУправленияТелеграммБотом.Получить());
  
  ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
  
  ШаблонСообщения = ТекстСообщения;
  
  ТелоОбъекта = Новый Структура;
  ТелоОбъекта.Вставить("chat_id", ИдентификаторГруппы);
  ТелоОбъекта.Вставить("text", ШаблонСообщения);
  
  Запись = Новый ЗаписьJSON;
  Запись.УстановитьСтроку();
  ЗаписатьJSON(Запись, ТелоОбъекта);
  ТелоЗапроса = Запись.Закрыть();
  
  Заголовки = Новый Соответствие;
  Заголовки.Вставить("Content-Type", "application/json");
  
  Запрос = Новый HTTPЗапрос(СтрокаЗапроса, Заголовки);
  Запрос.УстановитьТелоИзСтроки(ТелоЗапроса); 
  
  Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
  
  Возврат Ответ.КодСостояния;
  
  Если Ответ.КодСостояния = 200 Тогда
    
    ЗаписьЖурналаРегистрации("HTTPСервисы.Отправка",УровеньЖурналаРегистрации.Информация,,,"Сообщение отправлено",);
    
    Возврат Ответ.КодСостояния;
    
  Иначе
    
    СтрокаОтвета = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
    ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка",УровеньЖурналаРегистрации.Ошибка,,,СтрокаОтвета,);
    
    Возврат Ложь;
    
  КонецЕсли;
  
КонецФункции


Процедура ВКМ_ОтправитьСообщениеТГ() Экспорт
  
  Запрос = Новый Запрос;
  Запрос.Текст ="ВЫБРАТЬ
                |  ВКМ_УведомленияТелеграмБоту.Наименование КАК Наименование,
                |  ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК Текст,
                |  ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка
                |ИЗ
                |  Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
  
  Выборка = Запрос.Выполнить().Выбрать();
  
  Пока Выборка.Следующий() Цикл
    
    Наименование = Выборка.Наименование;
    Текст = Выборка.Текст;
    
    ТекстСообщения = СтрШаблон("%1" + Символы.ПС + "%2", Наименование, Текст);
    
    СтатусСообщениеТГ = ТелеграмБотСообщение(ТекстСообщения);
    
    Если СтатусСообщениеТГ = 200 Тогда
      
      Выборка.Ссылка.ПолучитьОбъект().Удалить();
      
 КонецЕсли;
    
  КонецЦикла;

КонецПроцедуры

#КонецОбласти